LeoTishin-Lansaro/hw_10/bloggy_app/app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "author", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "PEPSI"], ["author", "Travis"], ["body", "Travis likes PEPSI and a lot of sugar cakes"], ["created_at", "2015-09-12 01:08:36.798712"], ["updated_at", "2015-09-12 01:08:36.798712"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["body", "Travis likes PEPSI and a lot of sugar cakes, also his weight is 350 lbs"], ["updated_at", "2015-09-12 01:09:01.693406"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)